Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd

s = pd.Series([4,8,15,16,23,42],index = ['a','b','c','d','e','f'])

In [7]:
print(s)

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [11]:
var = [1,3,45,63,233,33,34,2,5,2]
# len(var)
var_series = pd.Series(var)

In [12]:
var_series

0      1
1      3
2     45
3     63
4    233
5     33
6     34
7      2
8      5
9      2
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:


| Name   |Age   | Gender |
|--------|:----:|-------:|
| Alice  |25    | Female |
| Bob    |30    | Male   |
| Claire |27    | Female |

Then, print the DataFrame.

In [24]:
data = [["Name","Age","Gender"],['Alice',25,'Female'],['Bob',30,'Male'],['Claire',27,'Female']]
df = pd.DataFrame(data)
df

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [25]:
df.dtypes

0    object
1    object
2    object
dtype: object

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
"""
pandas.Series is a one dimensional array where as pandas.DataFrame is a Two dimensional array 
Series is a set of observation related to a single variable in series Data consistency is followed ie. in each column of series 
object have only one single type of value stored in it 

and DataFrame is a collection of series object containing Rows and Columns 
DataFrame too obeys Data consistency but limited to column ie. same type of value in columns not throught out the DataFrame or array 
"""

# Series type showcased in Question 1 & 2 while DataFrame shown in Question 3 
# in que 3 each column preserve the type

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
# Common Functions in pandas 
#Read - to read files like html, csv, excel and many more like such (sytnax df.read('link/location/name of file'))
#head() - display top 5 rows from Datasets (if args pass then that much rows will be displayed)
#shape - shows dimensions of our dataframe
#info() - display various info about our data like colmn name , its type, no. of non null values 
#to_datetime() - DateTime obj in file read as string while reading csv file soo this use to again change back to datatime obj
#isnull()/sum() - through this we can find no. of null values in df
# drop() -used to drop any particular column {syntax: df.drop(['country_name'],axis = 1 , inplace =True)
#describe() - to get particular info about like count, mean, standard deviation, min, and 25,50,75,max values 
#fillna() - if values passed in arguments to any missing or null value present in df
# df['country_name'].fillna('Nan')
# and soo many other functions are there to manipulate data 

#loc and iloc() is highly used to slice data from panda df 

# loc - select by labels : df.loc[:5,['driver_age','voilation']] this gave first first 6 rows for driver_age and voilation data 
# iloc - select by positions. this slice the df in specified rows and columns range
# df.iloc(:5,:5) first 5 rows and first 5 columns

#iloc arguments are purely integer based whereas loc args could be int or conditions

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
# All three data structure - Series, DataFrame and Panel are mutable in nature. This means that their values can be changed 
# after they have been created. However while Df and Panels are both size mutable ie. their size can be changed but Series
# is only value mutalbe means its size can't be changed

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
import pandas as pd
s1 = pd.Series(['mark','barket','tom','job'],name='writer')
s2 = pd.Series(['cookbook','html5','python','numpy'],name = 'title')
s3 = pd.Series([2453,460.50,12.50,50.00],name = 'price',)

df = pd.concat([s1,s2,s3],axis = 1)
df

   writer     title   price
0    mark  cookbook  2453.0
1  barket     html5   460.5
2     tom    python    12.5
3     job     numpy    50.0

In [38]:
type(df)

pandas.core.frame.DataFrame